b=int(input("Здравствуйте!Введите значение первого элемента геометрической прогрессии от -10000 до 10000:")) #первый член геом прогрессии
q=int(input("Здравствуйте!Введите значение множителя геометрической прогресии от 1 до 50:")) #множитель прогрессии
n=int(input("Здравствуйте!Введите значение номера последнего элемента от 2 до 100:")) #номер последнего элемента прогрессии
if -10000<=b<=10000 and q==1 and 2<=n<=100 :
    print("Сумма геометрической прогрессии=",(b*n)) #считает сумму геом прогрессии если q равно 1
elif -10000<=b<=10000 and 1<q<=50 and 2<=n<=100 :
    print("Сумма геометрической прогрессии=",(b*((q**n)-1))/(q-1)) #считает сумму геом прогрессии если q не равно 1
else :
    print("Введите другие значения")